[
  "edit:null:Open a text file for editing. The first parameter is the name of the file to edit. Appropriate syntax highlighting is deduced from the file extension, or the file may include a shebang at the very beginning (--!lua or #!paisley) to indicate the syntax.\nF1 clears the current line.\nF2 deletes the current line.\nF3 copies the current line.\nF4 pastes the last copied line.\nF6 saves the file, F8 cancels.",
  "ls:null:List all items in the given directories. If none is given, lists the current directory.",
  "cd:boolean:Change the current directory. Returns true on success, false on failure.",
  "run:boolean:Runs a Paisley or Lua script from a file. The type of script is deduced from the file extension, or the file may include a shebang at the very beginning (--!lua or #!paisley) to indicate the script type. Returns true if the file exists, false otherwise. Any errors are printed to the console.",
  "read:string|null:Reads the contents of a file. If the file does not exist, null is returned.",
  "cat:null:Prints the contents of a file.",
  "mkdir:boolean:Create a directory. Returns true if successful, false otherwise.",
  "mkfile:boolean:Create a file with contents. Returns true if successful, false otherwise.",
  "dir:string:Gets the current working directory.",
  "pwd:null:Prints the current working directory.",
  "touch:boolean:Create an empty file. Returns true if successful, false otherwise.",
  "rm:boolean:Delete the given files or directories. Returns true if successful, false otherwise.",
  "play:null:Plays a sound from the Plasma sound library. The sound EMPTY will stop playback.",
  "exists:boolean:Checks whether a file path exists.",
  "isfile:boolean:Checks whether a file path exists and is a file.",
  "isdir:boolean:Checks whether a file path exists and is a directory.",
  "mv:boolean:Move a file or directory from one location to another. Returns true on success, false otherwise.",
  "cp:boolean:Copy a file or directory from one location to another. Returns true on success, false otherwise.",
  "*:array[string]:List all files and directories in the given directory, or current dir if not specified.",
  "*file:array[string]:List all files in the given directory, or current dir if not specified.",
  "*dir:array[string]:List all directories in the given directory, or current dir if not specified."
]